### DataFrame:
- Two dimensional
- size mutable
- labeled axis (rows and columns)

### Creating DataFrame:
- `D` and `F` should be capital in `DataFrame` word.

In [1]:
import pandas as pd

#### Empty DataFrame:

In [2]:
emp_df = pd.DataFrame()
print(emp_df)
print(type(emp_df))

Empty DataFrame
Columns: []
Index: []
<class 'pandas.core.frame.DataFrame'>

#### Creating DataFrame from List:

In [3]:
list = pd.DataFrame (['a','b','c'])
print(list)
print(type(list))

   0
0  a
1  b
2  c
<class 'pandas.core.frame.DataFrame'>

In [4]:
list

   0
0  a
1  b
2  c

In [5]:
list_list = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
print(list_list)
print(type(list_list))

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
<class 'pandas.core.frame.DataFrame'>

In [6]:
list_list

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### Creating DataFrame from Dictionary:

In [7]:
dict1 = {'1D':[11,22,33,44]}
dict1

{'1D': [11, 22, 33, 44]}

In [8]:
df3 = pd.DataFrame(dict1)
print(df3)

   1D
0  11
1  22
2  33
3  44

In [9]:
df3

   1D
0  11
1  22
2  33
3  44

#### In one dictionary, all array should be same count otherwise Value Error.
#### In multiple dictionary, value count can be change and it will give `NaN` for missing values.

In [10]:
# dict2= {'1D':[11,22,33,44], 'SN': [1,2,3]}
# df4 = pd.DataFrame(dict2)
# print(df4)

# ValueError: All arrays must be of the same length

In [11]:
dict2= {'1D':[11,22,33,44], 'SN': [1,2,3,4]}
df4 = pd.DataFrame(dict2)
print(df4)

   1D  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [12]:
df4 = pd.DataFrame(dict2)
print(df4)

   1D  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [13]:
df4

   1D  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [14]:
ls_dict = [{'a':1 , 'b':2},{'a':3, 'b':4}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [15]:
df5= pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [16]:
# One list with two dictionaries, and each dictionary has different counts
# Will give NaN for missing values
df6 = pd.DataFrame([{'a':1, 'b':2}, {'a':3,'b':4, 'c':5}])
df6

   a  b    c
0  1  2  NaN
1  3  4  5.0

#### Creating DataFrame with Dictionaries of Series

In [17]:
dict_ser = {'ID': pd.Series([1,2,3]), 'SN': pd.Series([111,222,333])}
print (dict_ser)

{'ID': 0    1
1    2
2    3
dtype: int64, 'SN': 0    111
1    222
2    333
dtype: int64}

In [18]:
df7 = pd.DataFrame(dict_ser)
df7

   ID   SN
0   1  111
1   2  222
2   3  333

In [19]:
# ❌ Example 1: Dictionary of lists with unequal lengths

# Each key (1D and SN) becomes a column name, and each list becomes that column's data
# '1D' → [11, 22, 33, 44]  (4 values)
# 'SN' → [1, 2, 3]         (3 values)
# pandas requires all columns to have the SAME number of rows
# So this will raise: ValueError: All arrays must be of the same length

# df5 = pd.DataFrame({'1D': [11, 22, 33, 44], 'SN': [1, 2, 3]})
# Result:
#   1D   SN
#  11    1
#  22    2
#  33    3
#  44    ?   --> ❌ Error (missing value, unequal column length)


# ✅ Example 2: List of dictionaries (each dictionary = one row)
# Missing keys are automatically filled with NaN
# Columns are taken as the union of all dictionary keys

# df5 = pd.DataFrame([{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 5}])
# Result:
#      a    b    c
#  0   1    2   NaN
#  1   3    4   5.0
#
# Explanation:
# Row 1 → {'a':1, 'b':2}  → no 'c' key → NaN
# Row 2 → {'a':3, 'b':4, 'c':5} → all keys present